BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаЗатрат/ИНАГРО_КорректировкаЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_КорректировкаЗатрат</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыОрганизаций</registerRecords>
  <attributes>
    <name>ИнформацияОтбор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment> Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратПолучатель</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПолучатель</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппаПолучатель</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатратПолучатель</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначениеПолучатель</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_ЗатратыОрганизаций/ИНАГРО_ЗатратыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИНАГРО_ЗатратыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.БиологическиеАктивы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаЗатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
			
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверитьЗаполнениеТабличнойЧастиЗатраты(Отказ); 	
		
	Если НЕ Отказ Тогда
		// Формирование движения регистров
		ДвиженияПоРегистрам(Отказ, Заголовок, РежимПроведения);
	КонецЕсли;
	
	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

Процедура ПроверитьЗаполнениеТабличнойЧастиЗатраты(Отказ)	
	
	ПредставлениеТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.Затраты.Представление();
	
	Для каждого СтрокаТЧ Из Затраты Цикл
	
		СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табличной части ""%2"": ';uk='У рядку номер ""%1"" табличної частини ""%2"": '"), СокрЛП(СтрокаТЧ.НомерСтроки), ПредставлениеТабличнойЧасти);
		ЧислоАктивныхСубконто = СтрокаТЧ.СчетЗатратПолучатель.ВидыСубконто.Количество();
		
		Для Сч = 1 По ЧислоАктивныхСубконто Цикл
			
			Если СтрокаТЧ.СчетЗатратПолучатель.ВидыСубконто[Сч - 1].ВидСубконто.Наименование = "Номенклатурные группы" И НЕ ЗначениеЗаполнено(СтрокаТЧ.НоменклатурнаяГруппаПолучатель) Тогда
				СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита Номенклатурная группа получатель""';uk='Не заповнене значення реквізиту Номенклатурна група отримувач""'") + """!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаНачалаСообщенияОбОшибке + СтрокаСообщения, , , , Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
		
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Заголовок, РежимПроведения)
	
	ДатаНКУ2015 = '2015 01 01';

	мОперация = Движения.Хозрасчетный;
	
	СписокСчетовЗатрат = Новый СписокЗначений;
	СписокСчетовЗатрат.Добавить(ПланыСчетов.Хозрасчетный.Производство);
	СписокСчетовЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);  	

	Для Каждого СтрокаТЧЗатраты Из Затраты Цикл
		
		Если Сторно Тогда
			
			ПроводкиБУ = мОперация.Добавить();
			ПроводкиБУ.Организация 	= ЭтотОбъект.Организация;
			ПроводкиБУ.Период 		= ЭтотОбъект.Дата;
			ПроводкиБУ.Содержание 	= НСтр("ru='Перенос затрат будущих периодов';uk='Перенесення витрат майбутніх періодів'");
			ПроводкиБУ.Сумма 		= СтрокаТЧЗатраты.Сумма;
			Сч = 0;
			ПроводкиБУ.СчетДт = СтрокаТЧЗатраты.СчетЗатратПолучатель;
			Для Каждого Строка Из ПроводкиБУ.СчетДт.ВидыСубконто Цикл
				Если Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда 
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки, СтрокаТЧЗатраты.ПодразделениеПолучатель);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки,  СтрокаТЧЗатраты.НоменклатурнаяГруппаПолучатель);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт,  Строка.НомерСтроки, СтрокаТЧЗатраты.СтатьяЗатратПолучатель);
				КонецЕсли;
			КонецЦикла;

			ПроводкиБУ.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
			
			Если ПроводкиБУ.Период < ДатаНКУ2015 Тогда
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначениеПолучатель;
					ПроводкиБУ.СуммаНУДт = СтрокаТЧЗатраты.СуммаНУ;
				КонецЕсли;
			Иначе
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					Если ПроводкиБУ.СчетДт.УчетПоНалоговымНазначениямНДС Тогда
						ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначениеПолучатель;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПроводкиБУ = мОперация.Добавить();
			ПроводкиБУ.Организация 	= ЭтотОбъект.Организация;
			ПроводкиБУ.Период 		= ЭтотОбъект.Дата;
			ПроводкиБУ.Содержание 	= НСтр("ru='Перенос затрат будущих периодов';uk='Перенесення витрат майбутніх періодів'");
			ПроводкиБУ.Сумма 		= - СтрокаТЧЗатраты.Сумма;
			Сч = 0;
			ПроводкиБУ.СчетДт = СтрокаТЧЗатраты.СчетЗатрат;
			
			Для Каждого Строка Из ПроводкиБУ.СчетДт.ВидыСубконто Цикл
				Если Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда 
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки, СтрокаТЧЗатраты.Подразделение);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки,  СтрокаТЧЗатраты.НоменклатурнаяГруппа);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт,  Строка.НомерСтроки, СтрокаТЧЗатраты.СтатьяЗатрат);
				КонецЕсли;
			КонецЦикла;
			
			ПроводкиБУ.СчетКт = ПланыСчетов.Хозрасчетный.Вспомогательный;
			
			Если ПроводкиБУ.Период < ДатаНКУ2015 Тогда
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначение;
					ПроводкиБУ.СуммаНУДт = - СтрокаТЧЗатраты.СуммаНУ;
				КонецЕсли;
			Иначе
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					Если ПроводкиБУ.СчетДт.УчетПоНалоговымНазначениямНДС Тогда
						ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначение;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ПроводкиБУ = мОперация.Добавить();
			ПроводкиБУ.Организация 	= ЭтотОбъект.Организация;
			ПроводкиБУ.Период 		= ЭтотОбъект.Дата;
			ПроводкиБУ.Содержание 	= НСтр("ru='Перенос затрат будущих периодов';uk='Перенесення витрат майбутніх періодів'");
			Сч = 0;
			ПроводкиБУ.СчетДт = СтрокаТЧЗатраты.СчетЗатратПолучатель;
			Для Каждого Строка Из ПроводкиБУ.СчетДт.ВидыСубконто Цикл
				Если Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда 
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки, СтрокаТЧЗатраты.ПодразделениеПолучатель);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт, Строка.НомерСтроки,  СтрокаТЧЗатраты.НоменклатурнаяГруппаПолучатель);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетДт, ПроводкиБУ.СубконтоДт,  Строка.НомерСтроки, СтрокаТЧЗатраты.СтатьяЗатратПолучатель);
				КонецЕсли;
			КонецЦикла;
			ПроводкиБУ.СчетКт = СтрокаТЧЗатраты.СчетЗатрат;
			Для Каждого Строка Из ПроводкиБУ.СчетКт.ВидыСубконто Цикл
				Если Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения Тогда 
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетКт, ПроводкиБУ.СубконтоКт, Строка.НомерСтроки, СтрокаТЧЗатраты.Подразделение);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетКт, ПроводкиБУ.СубконтоКт, Строка.НомерСтроки,  СтрокаТЧЗатраты.НоменклатурнаяГруппа);
				ИначеЕсли Строка.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда
					БухгалтерскийУчет.УстановитьСубконто(ПроводкиБУ.СчетКт, ПроводкиБУ.СубконтоКт,  Строка.НомерСтроки, СтрокаТЧЗатраты.СтатьяЗатрат);
				КонецЕсли;
			КонецЦикла;
			
			Если ПроводкиБУ.Период < ДатаНКУ2015 Тогда
			
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначениеПолучатель;
					ПроводкиБУ.СуммаНУДт = СтрокаТЧЗатраты.СуммаНУ;
				КонецЕсли;
				Если ПроводкиБУ.СчетКт.НалоговыйУчет Тогда
					ПроводкиБУ.НалоговоеНазначениеКт = СтрокаТЧЗатраты.НалоговоеНазначение;
					ПроводкиБУ.СуммаНУКт = СтрокаТЧЗатраты.СуммаНУ;
				КонецЕсли;
				
			Иначе
				
				Если ПроводкиБУ.СчетДт.НалоговыйУчет Тогда
					Если ПроводкиБУ.СчетДт.УчетПоНалоговымНазначениямНДС Тогда
						ПроводкиБУ.НалоговоеНазначениеДт = СтрокаТЧЗатраты.НалоговоеНазначениеПолучатель;
					КонецЕсли;
				КонецЕсли;
				Если ПроводкиБУ.СчетКт.НалоговыйУчет Тогда
					Если ПроводкиБУ.СчетКт.УчетПоНалоговымНазначениямНДС Тогда
						ПроводкиБУ.НалоговоеНазначениеКт = СтрокаТЧЗатраты.НалоговоеНазначение;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			ПроводкиБУ.Сумма 		= СтрокаТЧЗатраты.Сумма;
			
		КонецЕсли;
		
		
		Если Сторно Тогда
			
			Если ИНАГРО_Общий.ИНАГРО_СчетВСпискеПоИерархии(СтрокаТЧЗатраты.СчетЗатрат, СписокСчетовЗатрат) Тогда
				Движение = Движения.ИНАГРО_ЗатратыОрганизаций.Добавить();
				Движение.ВидДвижения 	      = ВидДвиженияНакопления.Приход;
				Движение.Период 		      = ЭтотОбъект.Дата;
				Движение.Организация 	      = ЭтотОбъект.Организация;
				Движение.СчетЗатрат 		  = СтрокаТЧЗатраты.СчетЗатрат;
				Движение.Подразделение 		  = СтрокаТЧЗатраты.Подразделение;
				Движение.НоменклатурнаяГруппа = СтрокаТЧЗатраты.НоменклатурнаяГруппа;
				Движение.СтатьяЗатрат 		  = СтрокаТЧЗатраты.СтатьяЗатрат;
				Движение.Количество 		  = - СтрокаТЧЗатраты.Количество;
				Движение.НалоговоеНазначениеДоходовИЗатрат = СтрокаТЧЗатраты.НалоговоеНазначение;
				Движение.Сумма 				  = - СтрокаТЧЗатраты.Сумма;
				Движение.СуммаНУ 			  = - СтрокаТЧЗатраты.СуммаНУ;
			КонецЕсли;
			
		Иначе
			
			Если ИНАГРО_Общий.ИНАГРО_СчетВСпискеПоИерархии(СтрокаТЧЗатраты.СчетЗатрат, СписокСчетовЗатрат) Тогда
				Движение = Движения.ИНАГРО_ЗатратыОрганизаций.Добавить();
				Движение.ВидДвижения 	      = ВидДвиженияНакопления.Расход;
				Движение.Период 		      = ЭтотОбъект.Дата;
				Движение.Организация 	      = ЭтотОбъект.Организация;
				Движение.СчетЗатрат 		  = СтрокаТЧЗатраты.СчетЗатрат;
				Движение.Подразделение 		  = СтрокаТЧЗатраты.Подразделение;
				Движение.НоменклатурнаяГруппа = СтрокаТЧЗатраты.НоменклатурнаяГруппа;
				Движение.СтатьяЗатрат 		  = СтрокаТЧЗатраты.СтатьяЗатрат;
				Движение.Количество 		  = СтрокаТЧЗатраты.Количество;
				Движение.НалоговоеНазначениеДоходовИЗатрат = СтрокаТЧЗатраты.НалоговоеНазначение;
				Движение.Сумма 				  = СтрокаТЧЗатраты.Сумма;
				Движение.СуммаНУ 			  = СтрокаТЧЗатраты.СуммаНУ;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ИНАГРО_Общий.ИНАГРО_СчетВСпискеПоИерархии(СтрокаТЧЗатраты.СчетЗатратПолучатель, СписокСчетовЗатрат) Тогда
			Движение = Движения.ИНАГРО_ЗатратыОрганизаций.Добавить();
			Движение.ВидДвижения 	      = ВидДвиженияНакопления.Приход;
			Движение.Период 		      = ЭтотОбъект.Дата;
			Движение.Организация 	      = ЭтотОбъект.Организация;
			Движение.СчетЗатрат 		  = СтрокаТЧЗатраты.СчетЗатратПолучатель;
			Движение.Подразделение 		  = СтрокаТЧЗатраты.ПодразделениеПолучатель;
			Движение.НоменклатурнаяГруппа = СтрокаТЧЗатраты.НоменклатурнаяГруппаПолучатель;
			Движение.СтатьяЗатрат 		  = СтрокаТЧЗатраты.СтатьяЗатратПолучатель;
			Движение.Количество 		  = СтрокаТЧЗатраты.Количество;
			Движение.НалоговоеНазначениеДоходовИЗатрат = СтрокаТЧЗатраты.НалоговоеНазначениеПолучатель;
			Движение.Сумма 				  = СтрокаТЧЗатраты.Сумма;
			Движение.СуммаНУ 			  = СтрокаТЧЗатраты.СуммаНУ;
		КонецЕсли;
	
		
	КонецЦикла;  	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
